class TXBasic:
    '''
    Базовый класс ТХ
    Начнём с него, постепенно новые прикрутим.

    '''

    def __init__(self, name):
        self.name = name
#         Расход через турбину
#         Расход через компрессор
#         Расход через вентилятор
#         Наличие вентилятора
#         Наличие компрессора
#         Подшипники газодинамические
#         Объём масла в картере
#         Тип применяемого масла
#         Номинальные параметры рабочей среды на входе в турбину (словарь)
#         Номинальные параметры рабочей среды на входе в компрессор (словарь)
#         Номинальные параметры рабочей среды на входе в вентилятор (словарь)
#         Масса

